<a href="https://colab.research.google.com/github/pragmatizt/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/Ira_E_LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-08-12 21:23:42--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.106.13
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.106.13|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  47.2MB/s    in 4.6s

2019-08-12 21:23:46 (43.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
# Loading every one of the csv's.
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
# trying out the tolist() call.
products.columns.tolist()

['product_id', 'product_name', 'aisle_id', 'department_id']

In [0]:
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [0]:
departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [0]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [0]:
# Let's see which columns I need.
# This is redundant, but if I didn't do pd.read_csv, we can also 
# find out column headers by doing the methods below:
!head aisles.csv

aisle_id,aisle
1,prepared soups salads
2,specialty cheeses
3,energy granola bars
4,instant foods
5,marinades meat preparation
6,other
7,packaged meat
8,bakery desserts
9,pasta sauce

In [0]:
# departments
!head departments.csv

department_id,department
1,frozen
2,other
3,bakery
4,produce
5,alcohol
6,international
7,beverages
8,pets
9,dry goods pasta

In [0]:
# order_products__prior
!head order_products__prior.csv

order_id,product_id,add_to_cart_order,reordered
2,33120,1,1
2,28985,2,1
2,9327,3,0
2,45918,4,1
2,30035,5,0
2,17794,6,1
2,40141,7,1
2,1819,8,1
2,43668,9,0

In [0]:
# order_products__train
!head order_products__train.csv

order_id,product_id,add_to_cart_order,reordered
1,49302,1,1
1,11109,2,1
1,10246,3,0
1,49683,4,0
1,43633,5,1
1,13176,6,0
1,47209,7,0
1,22035,8,1
36,39612,1,0

In [0]:
# orders
!head orders.csv

order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2539329,1,prior,1,2,08,
2398795,1,prior,2,3,07,15.0
473747,1,prior,3,3,12,21.0
2254736,1,prior,4,4,07,29.0
431534,1,prior,5,4,15,28.0
3367565,1,prior,6,2,07,19.0
550135,1,prior,7,1,09,20.0
3108588,1,prior,8,1,14,14.0
2295261,1,prior,9,1,16,0.0

In [0]:
# products
!head products.csv

# Okay, we get the product name.  How do we do a count?
# Let's look at other datasets and see what connects aisle_id and department_id.

product_id,product_name,aisle_id,department_id
1,Chocolate Sandwich Cookies,61,19
2,All-Seasons Salt,104,13
3,Robust Golden Unsweetened Oolong Tea,94,7
4,Smart Ones Classic Favorites Mini Rigatoni With Vodka Cream Sauce,38,1
5,Green Chile Anytime Sauce,5,13
6,Dry Nose Oil,11,11
7,Pure Coconut Water With Orange,98,7
8,Cut Russet Potatoes Steam N' Mash,116,1
9,Light Strawberry Blueberry Yogurt,120,16

In [0]:
# it looks like we need the following columns:
# product_name, order_dow, order_hour_of_day,

In [0]:
product_names = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

In [0]:
# Looks like we only need two dataframes. 
# Products, and order_products__prior.  
products.columns.tolist()

['product_id', 'product_name', 'aisle_id', 'department_id']

In [0]:
order_products__prior.columns.tolist()

['order_id', 'product_id', 'add_to_cart_order', 'reordered']

In [0]:
# Merging them together
# from products: product_id and product_name
# from __prior: product_id and order_id.
merged_assignment = (products[['product_id', 'product_name']]
                    .merge(order_products__prior[['order_id', 'product_id']]))

In [0]:
merged_assignment.head()

   product_id                product_name  order_id
0           1  Chocolate Sandwich Cookies      1107
1           1  Chocolate Sandwich Cookies      5319
2           1  Chocolate Sandwich Cookies      7540
3           1  Chocolate Sandwich Cookies      9228
4           1  Chocolate Sandwich Cookies      9273

In [0]:
# eye test to see if they add up
merged_assignment.shape, products.shape, order_products__prior.shape

((32434489, 3), (49688, 4), (32434489, 4))

In [0]:
condition = ((merged_assignment['product_name']=='Banana') |
              (merged_assignment['product_name']=='Bag of Organic Bananas') |
              (merged_assignment['product_name']=='Organic Strawberries') | 
              (merged_assignment['product_name']=='Organic Baby Spinach') |
              (merged_assignment['product_name']=='Organic Hass Avocado') |
              (merged_assignment['product_name']=='Organic Avocado') |
              (merged_assignment['product_name']=='Large Lemon') |
              (merged_assignment['product_name']=='Strawberries') |
              (merged_assignment['product_name']=='Limes') |
              (merged_assignment['product_name']=='Organic Whole Milk'))

merged_assignment = merged_assignment[condition]

subset_assignment = merged_assignment[condition]
merged_assignment.shape
              
"""
Banana
Bag of Organic Bananas
Organic Strawberries
Organic Baby Spinach
Organic Hass Avocado
Organic Avocado
Large Lemon
Strawberries
Limes
Organic Whole Milk
"""

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:14: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

'\nBanana\nBag of Organic Bananas\nOrganic Strawberries\nOrganic Baby Spinach\nOrganic Hass Avocado\nOrganic Avocado\nLarge Lemon\nStrawberries\nLimes\nOrganic Whole Milk\n'

In [0]:
# Checking #1
print(merged_assignment.shape)
merged_assignment.head()

(2323158, 3)

         product_id            product_name  order_id
7549085       13176  Bag of Organic Bananas         5
7549086       13176  Bag of Organic Bananas        27
7549087       13176  Bag of Organic Bananas        29
7549088       13176  Bag of Organic Bananas        32
7549089       13176  Bag of Organic Bananas        42

In [0]:
# Checking #2
merged_assignment

In [0]:
### Refer to this for later.

values = merged_assignment['product_name'].value_counts().keys().tolist()
counts = merged_assignment['product_name'].value_counts().tolist()

In [0]:
print(values)

['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

In [0]:
print(counts)

[472565, 379450, 264683, 241921, 213584, 176815, 152657, 142951, 140627, 137905]

In [80]:
# I got help on this part.  Why does this solution seem so simple???  I marked where I got stuck before starting where it says "### Refer to this for later"

merged_assignment['product_name'].value_counts()[:10]

Banana                    472565
Bag of Organic Bananas    379450
Organic Strawberries      264683
Organic Baby Spinach      241921
Organic Hass Avocado      213584
Organic Avocado           176815
Large Lemon               152657
Strawberries              142951
Limes                     140627
Organic Whole Milk        137905
Name: product_name, dtype: int64

In [0]:
counts_new = pd.Series(['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk'])
values_new = pd.Series([[472565, 379450, 264683, 241921, 213584, 176815, 152657, 142951, 140627, 137905]])
df_new = pd.DataFrame({'a': counts_new, 'b': values_new})

In [0]:
df_new

                        a                                                  b
0                  Banana  [472565, 379450, 264683, 241921, 213584, 17681...
1  Bag of Organic Bananas                                                NaN
2    Organic Strawberries                                                NaN
3    Organic Baby Spinach                                                NaN
4    Organic Hass Avocado                                                NaN
5         Organic Avocado                                                NaN
6             Large Lemon                                                NaN
7            Strawberries                                                NaN
8                   Limes                                                NaN
9      Organic Whole Milk                                                NaN

In [0]:
# Hmm, this didn't fix anything.  I would ideally love for the values in column B to also appear below.
df_new = df_new.reset_index()
df_new

   index  ...                                                  b
0      0  ...  [472565, 379450, 264683, 241921, 213584, 17681...
1      1  ...                                                NaN
2      2  ...                                                NaN
3      3  ...                                                NaN
4      4  ...                                                NaN
5      5  ...                                                NaN
6      6  ...                                                NaN
7      7  ...                                                NaN
8      8  ...                                                NaN
9      9  ...                                                NaN

[10 rows x 3 columns]

## Trying another way of setting a condition in place
### (this is not required per the assignment)

In [0]:
product_names1 = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 
                 'Organic Baby Spinach', 'Organic Hass Avocado', 'Large Lemon',
                 'Strawberries', 'Limes', 'Organic Whole Milk']

condition1 = merged_assignment['product_name'].isin(product_names1)
subset = merged_assignment[condition1]

"""
Banana
Bag of Organic Bananas
Organic Strawberries
Organic Baby Spinach
Organic Hass Avocado
Organic Avocado
Large Lemon
Strawberries
Limes
Organic Whole Milk
"""

'\nBanana\nBag of Organic Bananas\nOrganic Strawberries\nOrganic Baby Spinach\nOrganic Hass Avocado\nOrganic Avocado\nLarge Lemon\nStrawberries\nLimes\nOrganic Whole Milk\n'

In [0]:
print(subset.shape)
subset.head()

(2146343, 3)

         product_id            product_name  order_id
7549085       13176  Bag of Organic Bananas         5
7549086       13176  Bag of Organic Bananas        27
7549087       13176  Bag of Organic Bananas        29
7549088       13176  Bag of Organic Bananas        32
7549089       13176  Bag of Organic Bananas        42

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# copy/paste from lecture on this cell:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1_x = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2_x = table1_x.T

In [68]:
# Reset the index
table1 = table1_x.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [70]:
table1_x

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [72]:
# Do a .to_list() to look at columns in table  1
table1_x.columns.to_list()

['treatmenta', 'treatmentb']

In [73]:
# Let's do the same for the index
table1_x.index.to_list()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [74]:
tidy = (table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
       .rename(columns={
           'index':'name',
           'variable':'trt',
           'value':'result'
         }))

tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [71]:
table2_x

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [75]:
# Table 2.  Remove treatment a and treatment from being indices.
table2 = table2_x.reset_index().rename(columns={'index':'trt'})
table2

          trt  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [82]:
# Melt function for Table 2
# Note to self: pay special attention to value_vars, var_name, id_vars

tidy2 = (table2.melt(value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'],
                    var_name='name',
                    id_vars='trt',
                    value_name='result'
                    ))

tidy2.trt = tidy2.trt.str.replace('treatment','')
# replaced treatment with blanks so we just get a and b

tidy2 = tidy2.set_index('name')
tidy2

             trt  result
name
John Smith     a     NaN
John Smith     b     2.0
Jane Doe       a    16.0
Jane Doe       b    11.0
Mary Johnson   a     3.0
Mary Johnson   b     1.0

In [78]:
## Tidy ---> Table 2
table2

          trt  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [79]:
tidy2.reset_index().pivot(index='trt', columns='name', values='result')

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

## Seaborn Flight Problem

In [0]:
# Onto the flight problem
flights = sns.load_dataset('flights')

In [0]:
print(flights.shape)
flights.head()

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
flights.pivot_table(index='year', columns='month', values='passengers')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####